tap "abhinav/tap"
tap "claui/whence"
tap "cloudflare/cloudflare"
tap "homebrew/bundle"
tap "mattt/tap"
tap "mvndaemon/mvnd"
tap "render-oss/render"
tap "suzuki-shunsuke/cmdx"
# Run your GitHub Actions locally
brew "act"
# Declarative CLI Version manager
brew "aqua"
# Record and share terminal sessions
brew "asciinema"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Cloudflare Tunnel client (formerly Argo Tunnel)
brew "cloudflared"
# Cross-platform make
brew "cmake"
# Dependency manager for Cocoa projects
brew "cocoapods"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Play, record, convert, and stream select audio and video codecs
brew "ffmpeg"
# Interpreted, interactive, object-oriented programming language
brew "python@3.13"
# Duplicate file utility
brew "czkawka"
# Open source multi-tool for exploring and publishing data
brew "datasette"
# Load/unload environment variables based on $PWD
brew "direnv"
# Pack, ship and run any application as a lightweight container
brew "docker", link: false
# Convert text between DOS, UNIX, and Mac formats
brew "dos2unix"
# Select default apps for documents and URL schemes on macOS
brew "duti"
# Perl lib for reading and writing EXIF metadata
brew "exiftool"
# Modern, maintained replacement for ls
brew "eza"
# Collection of GNU find, xargs, and locate
brew "findutils"
# Firebase command-line tools
brew "firebase-cli"
# CLI application for interacting with a Cloudflare account
brew "flarectl"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Automatic git commit --fixup
brew "git-absorb"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Quickly rewrite git repository history
brew "git-filter-repo"
# GNU Privacy Guard (OpenPGP)
brew "gnupg"
# Command-line interface for Hetzner Cloud
brew "hcloud"
# Improved top (interactive process viewer)
brew "htop"
# Tools and libraries to manipulate images in select formats
brew "imagemagick"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Handy way to save and run project-specific commands
brew "just"
# Pager program similar to more
brew "less"
# Mac App Store command-line interface
brew "mas"
# Tool for working with usage-spec CLIs
brew "usage"
# Polyglot runtime manager (asdf rust clone)
brew "mise"
# CLI tool for saving complete web pages as a single HTML file
brew "monolith"
# Collection of tools that nobody wrote when UNIX was young
brew "moreutils", link: false
# 7-Zip (high compression file archiver) implementation
brew "p7zip"
# Parallel gzip
brew "pigz"
# Execute binaries from Python packages in isolated environments
brew "pipx"
# Fast, disk space efficient package manager
brew "pnpm"
# Show ps output as a tree
brew "pstree"
# Interpreted, interactive, object-oriented programming language
brew "python@3.11"
# Interpreted, interactive, object-oriented programming language
brew "python@3.12"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Utility that provides fast incremental file transfer
brew "rsync"
# Fast and accurate code counter with complexity and COCOMO estimates
brew "scc"
# Terminal multiplexer with VT100/ANSI terminal emulation
brew "screen"
# Command-line utility to interact with Sentry
brew "sentry-cli"
# Autoformat shell script source code
brew "shfmt"
# Feature-rich console based todo list manager
brew "task"
# Terminal multiplexer
brew "tmux"
# CLI tool that moves files or folder to the trash
brew "trash", link: true
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Vi 'workalike' with many additional features
brew "vim"
# Tool for creating isolated virtual python environments
brew "virtualenv"
# Internet file retriever
brew "wget"
# Linter for YAML files
brew "yamllint"
# JavaScript package manager
brew "yarn"
# Feature-rich command-line audio/video downloader
brew "yt-dlp"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# UNIX shell (command interpreter)
brew "zsh"
# Password manager that keeps all passwords secure behind one password
cask "1password"
# Command-line interface for 1Password
cask "1password-cli"
# 3D model slicing software for 3D printers, maintained by Bambu Lab
cask "bambu-studio"
# Virtual Audio Driver
cask "blackhole-2ch"
# Disk space visualiser
cask "daisydisk"
# Browser for SQLite databases
cask "db-browser-for-sqlite"
# Voice and text chat software
cask "discord"
# App to build and share containerised applications and microservices
cask "docker-desktop"
# Find and remove unwanted duplicate files and folders
cask "duplicate-file-finder"
# Calendar software
cask "fantastical"
cask "font-fira-mono-nerd-font"
cask "font-hack"
cask "font-hack-nerd-font"
cask "font-inconsolata-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "font-meslo-lg-nerd-font"
cask "font-source-code-pro"
# Set of tools to manage resources and applications hosted on Google Cloud
cask "gcloud-cli"
# Web browser
cask "google-chrome"
# Graphically shows disk usage within a file system
cask "grandperspective"
# Automated organisation
cask "hazel"
# Free and open-source media player
cask "iina"
# iPhone management application
cask "imazing"
# MCP server app for your application
cask "mattt/tap/imcp"
# Java IDE by JetBrains
cask "intellij-idea"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# JetBrains tools manager
cask "jetbrains-toolbox"
# Menu bar manager
cask "jordanbaird-ice"
# Open-source keystroke visualiser
cask "keycastr"
# Animated screen capture application
cask "licecap"
# Host-based application firewall
cask "little-snitch"
# File system integration
cask "macfuse"
# Open-source music notation software
cask "musescore"
# Open-source software for live streaming and screen recording
cask "obs"
# Quick Look plug-in that renders source code with syntax highlighting
cask "qlcolorcode"
# Quick Look generator for Markdown files
cask "qlmarkdown"
# Quick Look plugin for plaintext files without an extension
cask "qlstephen"
# Thumbnails, static previews, cover art and metadata for video files
cask "qlvideo"
# Quick Look plugin for JSON files
cask "quicklook-json"
# Quick Look generator for Adobe Swatch Exchange files
cask "quicklookase"
# Control your tools with a few keystrokes
cask "raycast"
# Instant messaging application focusing on security
cask "signal"
# Team communication and collaboration software
cask "slack"
# Music streaming service
cask "spotify"
# System monitor for the menu bar
cask "stats"
# Video game digital distribution service
cask "steam"
# Customise mouse buttons, wheels and cursor speed
cask "steermouse"
# Web browser focusing on security
cask "tor-browser"
# Disk encryption software focusing on security based on TrueCrypt
cask "veracrypt"
# Open-source code editor
cask "visual-studio-code"
# Video communication and virtual meeting platform
cask "zoom"
mas "AutoMounter", id: 1160435653
mas "Duplicate File Finder", id: 1032755628
mas "GarageBand", id: 682658836
mas "iA Writer", id: 775737590
mas "Name Mangler 3", id: 603637384
mas "Things", id: 904280696
mas "Windows App", id: 1295203466
mas "Xcode", id: 497799835
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "midouest.playdate-debug"
vscode "sumneko.lua"
